''' 元组 '''

rhyme1 = (1, 2, 3, 4, 5, '上山打老虎')
print(rhyme1)   #输出：(1, 2, 3, 4, 5, '上山打老虎')
rhyme2 = 1, 2, 3, '上山打老虎'
print(rhyme2)   #输出：(1, 2, 3, '上山打老虎')

print(rhyme1[-1])   #输出：上山打老虎
print(rhyme1[::-1])   #输出：('上山打老虎', 5, 4, 3, 2, 1)
print(rhyme1[2:3])   #输出：(3,)   #元组即使只有一个元素也要以逗号( , )结尾
print(rhyme1[2:2])  #输出：()  #一个元素也没有
print(rhyme1[0:5:2])   #输出：(1, 3, 5)

rhyme3 = (4, 5, 2, 3, 3, 3, 7, 3, 7)
print(rhyme3.count(3))  #输出：4   #元组的元素中，3 的个数
print(rhyme3.index(7))  #输出：6   #元组中元素 7 第一次出现的下标

a = (1, 2, 3)
b = (3, 4, 5)
print(a + b)    #输出:(1, 2, 3, 3, 4, 5)
print(a * 3)    #输出:(1, 2, 3, 1, 2, 3, 1, 2, 3)

