''' 列表的使用 '''
#下标检索是从 0 开始到(n-1)
#逆检索从 -1 开始到 -n

list1 = [1, 2, 3, 4, 5, "上山打老虎"]
print(list1)

for A in list1:     #将列表元素逐个打印
    print(A)

print(list1[2])     #打印第三个元素
print(list1[-2])    #打印倒数第二个元素

length = len(list1) #获取列表长度（返回整形）
print('list1有' + str(length) + "个元素")

##列表切片
print(list1[2:5])   #打印3~5,共3个元素([3, 4, 5])
print(list1[0:6])   #打印1~6,共6个元素([1, 2, 3, 4, 5, '上山打老虎'])
print(list1[0:6:2]) #从第0开始,步长为2([1, 3, 5])
print(list1[:6])    #输出第一个到第六个([1, 2, 3, 4, 5, '上山打老虎'])
print(list1[2:])    #输出第3个到结束([3, 4, 5, '上山打老虎'])
print(list1[:])     #输出全部([1, 2, 3, 4, 5, '上山打老虎'])
print(list1[::2])   #步长为2输出([1, 3, 5])
print(list1[::-1])  #倒序输出(['上山打老虎', 5, 4, 3, 2, 1])

